tutorials/heatTransfer/heatTransportSimpleFoam/Bentheimer/0_orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           uniform 1.0;
    }
    top
    {
        type            fixedValue;
        value           uniform 1;
    }
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    right
    {
        type            zeroGradient;
    }
    front
    {
        type            fixedValue;
        value           uniform 1.0;
    }
    back
    {
        type            fixedValue;
        value           uniform 1.0;
    }
}


// ************************************************************************* //
