tutorials/heatTransfer/heatTransportSimpleFoam/Bentheimer/system/postProcessDict
FoamFile
{
version     4.0;
format      ascii;
class       dictionary;
location    "system";
object      postProcessDict;
}

direction 0;


x1 7e-5;
y1 1e-5;
z1 1e-5;

x2 0.00205;
y2 0.00199;
z2 0.00199;
direction 0;

inletName left;
outletName right;

